# DpartPhaseDemolishedByOriginal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartPhaseDemolishedByOriginal Property
ParameterTypeId Class See Also
---
"Phase Demolished By Original"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartPhaseDemolishedByOriginal { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartPhaseDemolishedByOriginal As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartPhaseDemolishedByOriginal {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace